# 檢查使⽤者輸入的⽣⽇與年齡是否合於要求格式 
# ⽣⽇格式必須為yyyy-mm-dd，其中yyyy只可以
# 為 1900 到 2020，例如: 1981 或 2001。mm 
# 或 dd 都可以為 1 到 2 位數字。如果格式正
# 確，顯⽰「格式正確」，否則顯⽰「格式錯誤」 
# 年齡格式可以為整數或帶有⼩數的數字，介於0（含）~ 120（不含）
# --------------------------------------------------------
# ⽣⽇ (例如1981-1-1): 2000-2-30 
# ⽣⽇格式錯誤，請再輸入⼀次！ 
# ⽣⽇ (例如1981-1-1): 2000-2-28 
# ⽣⽇格式正確: 2000-2-28 
# 年齡 (可以為⼩數): 23. 
# 年齡格式錯誤，請再輸入⼀次！ 
# 年齡 (可以為⼩數): 23.12 
# 年齡格式正確: 23.12

import re
while True:
    birthday = input(f"生日(例如1981-1-1): ")
    birthdayReg = r"(19[0-9]{2}|20[01][0-9]|2020)-"\
                   "(((0?[13578]|1[02])-(0?[1-9]|[12][0-9]|3[01]))|"\
                   "((0?[469]|11)-(0?[1-9]|[12][0-9]|30))|"\
                   "((0?2)-(0?[1-9]|[12][0-9])))"
    pattern = re.compile(birthdayReg)
    if pattern.fullmatch(birthday):
        print(f"生日格式正確: {birthday}")
        break
    else:
        print(f"生日格式錯誤，請再輸入一次!")
while True:
    age = input(f"年齡(可以為小數): ")
    ageReg = r"([0-9]|[1-9][0-9]|1[01][0-9])(\.[0-9]{1,2})?"
    pattern = re.compile(ageReg)
    if pattern.fullmatch(age):
        print(f"年齡格式正確: {age}")
        break
    else:
        print(f"年齡格式錯誤，請再輸入一次!")
