# 假設⼀趟泰國之旅需要 20000 元與 5 天的假期。讓使⽤者輸入⾝上的錢與放假天數，並顯⽰對應結果
# -----------------------------------------------
# | 錢 >= 20000 | 假期 >= 5 |      列印結果      |
# |   True      |   True    |    可以去泰國玩    |
# |   True      |   False   |      有錢沒閒      |
# |   False     |   True    |      有閒沒錢      |
# |   False     |   False   |   沒錢沒閒，真可憐  |
# ------------------------------------------------
money = int(input("請輸入身上的錢: "))
holiday = int(input("請輸入放假天數: "))

if money >= 20000:
    if holiday >= 5:
        print('可以去泰國玩')
    else:
        print('有錢沒閒')
else:
    if holiday >= 5:
        print('有閒沒錢')
    else:
        print('沒錢沒閒，真可憐')
